04_Simulation/PH_2D_RANS_kOmegaSSTx_baseline_pimpleURANS_Mesh_270_by_290/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; //steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)                    bounded Gauss upwind;
    div(phi,k)                    bounded Gauss upwind; //limitedLinear 1; //bounded Gauss upwind;
    div(phi,omega)                bounded Gauss upwind; //limitedLinear 1; //bounded Gauss upwind;
    div((nuEff*dev(T(grad(U)))))  Gauss linear;
    div(dev(((2*k)*Ax)))          Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
